Fried-Electronics/FE2202-DRV8876-Breakout/STM32 Software/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DRV1_IPROPI_Pin GPIO_PIN_0
#define DRV1_IPROPI_GPIO_Port GPIOA
#define DRV2_IPROPI_Pin GPIO_PIN_1
#define DRV2_IPROPI_GPIO_Port GPIOA
#define DRV1_FB_Pin GPIO_PIN_2
#define DRV1_FB_GPIO_Port GPIOA
#define DRV2_FB_Pin GPIO_PIN_3
#define DRV2_FB_GPIO_Port GPIOA
#define DRV2_IN1_Pin GPIO_PIN_0
#define DRV2_IN1_GPIO_Port GPIOB
#define DRV2_IN2_Pin GPIO_PIN_1
#define DRV2_IN2_GPIO_Port GPIOB
#define DRV1_IN1_Pin GPIO_PIN_6
#define DRV1_IN1_GPIO_Port GPIOC
#define DRV1_IN2_Pin GPIO_PIN_7
#define DRV1_IN2_GPIO_Port GPIOC
#define nSLEEP_Pin GPIO_PIN_8
#define nSLEEP_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
